http://algolist.manual.ru/sort/bubble_sort.php
	сайт с стандартными алгоритмами.
	Можно найти и лучшие материалы, но про этот сайт вспоминаешь быстрее.
	
книга "Алгоритмические трюки для программистов" Уоррен
	материал будет по силам, кто уже знаком с указателями, массивами, логическими операциями 
	и в целом имет небольшое представление об алгоритмах.
	Для первого курса - рановато.
	
https://www.cs.usfca.edu/~galles/visualization/ComparisonSort.html
	визуализация алгоримтво сортировки
	
https://e-maxx.ru/algo/
