Как правильно задавать вопросы, если ты начинающий айтишник
	https://habr.com/ru/post/460221/
	в качестве вводной - коротко, доступно, но примеров нет.
	Для раскрытия темы - ссылки ниже.
Eric Steven Raymond - Как правильно задавать вопросы
	http://citforum.ru/howto/smart-questions-ru.shtml
Саймон Тэтхем - Как эффективно сообщать об ошибках
	https://www.chiark.greenend.org.uk/~sgtatham/bugs-ru.html
	
	
Если что-то не понятно, что-то нужно повторно объяснить, то действуйте согласно правилу 15 минут.
Но немного модифицирем его:
	1.самостоятельное решение
		15 минут пытайтесь самостоятельно осмыслить и найти решение.
	2.составить вопрос
		По истечению этого времени составьте вопрос и описание вашей проблемы.
		Если что-то не получается осмыслить, то найдите начало, с какого места стало не понятно.
		Формулировка "с самого начала\все" подразумевает, что вы еще не начали разбирать тему, потому начала и нет.
		Правильно составленный вопрос содержит в себе до 70% ответа.
	3.Поиск по вопросу
		Далее 15 минут пытаемся что-то найти в интернете по необходимой тематике.
		В рамках программирования часто помогает сайт http://stackoverflow.com/
	4.И если опять ничего не вышло - пишите на почту tt48 на майле.

За вопросы штрафных баллов не начисляется.
	Даже напротив, разумная активность разумно привествуется.
Важно не откладывать.
Важно учиться задавать вопросы.
Важно равномерно распределять нагрузку.

Является хорошим результатом:
	1.спросить что-то по почте\на занятии
		так я вижу, что вы идете правильным направлением и нарабатываете навык составления вопросов
		так я понимаю, какой материал нужно расширить\уточнить\разобрать\рассказать в другом ракурсе
		и курс становится проще в освоении, а мне его проще вести
		и это все идет в плюс в рамках колонки "активность"
	2.делать медленно, немного, но каждый день
	
Является плохим результатом:
	1.Игонорирование\откладывание задания на "завтра"
	2.Сдача лаб с сильным отставанием от графика
		задания связные и темп будет нарастать.
		потому отставание имеет накопительный эффект.
	3.Попытка сделать и сдать все в последний день
		Даже если все успеете, у меня не будет впечатления о вас в рамках семестра
		и будет достаточно тяжело отделить "все списал" от "сделал сам".
		И стабильность\долговременность таких успехов под вопросом
			см. кривая забывания Эббингауза. 
			Например: 
			Кривая Эббингауза: как хакнуть свою память и запоминать до 95% информации
				https://habr.com/ru/company/englishdom/blog/497162/
		В среднем это приводит к снижению оценки на пару баллов.
	4.Игнорирование заданий, потому как "там все понятно".
		Если оно "все понятно", то оно не должно составить труда стать "уже сделано".
		В противном случае "все понятно" - лишь заблуждение.