Темы необходимо согласовывать со мной. Чтобы не было по 10 человек на одну тему.
Объединяться можно.
Время на доклад - примерно 15 минут. 20 - уже многовато, но зависит от вашей темы.

Аспекты стандартные для любого пакета:
	1. работа с символьными выражениями (объявление переменных, упрощение, замена части выражения, операции над выражениями)
	2. интегрирование символьное
	3. дифференцирование символьное
	4. решение алг. уравнений в симв. виде(аналитически)
	5. решение систем, неравенств.
	6. решение ДУ, систем ДУ
	7. построение графиков
вторично, но хотелось бы тоже затронуть, если вдруг по времени укладываетесь:
	численные методы
	, интеграция с языками программирования
	
Что нужно: по каждому пункту надо бы типичные примеры применения, с разбором особенностей и возможностей.

Например, касаемо sympy — есть ряд разобранных типовых задач в книжке «Введение в научный Python».
Только обратите внимание, что там уже на пару лет устаревший интерфейс по работе с пакетами используется (тот же запрещенный теперь уже метод hold у графиков matplotlib) и есть опечатки — примеры из коробки могут не заработать.
Для других пакетов\ПО типовые задачи тоже вполне можно смотреть по упомянутой книжке.

Темы:
	sympy
	MatLab
	Maple
	MathCad
	Wolfram Mathematica
	...
	больше ПО по символьным вычислениям - см. https://en.wikipedia.org/wiki/List_of_computer_algebra_systems
	интересуют только пакеты с возможностью символьных вычислений.
	Чисто статистические пакеты (SPSS, Statistica), численные методы - вне рамок нашего курса.
	Т.е., например, подойдут пакеты, указанные в параграфе computer algebra system
		https://en.wikipedia.org/wiki/List_of_open-source_software_for_mathematics
	
	